project05/project04/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate page: params[:page], order: 'created at desc', per_page: 10

INSERT INTO "articles" ("author_name", "body", "created_at", "creation_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "articles" SET "title" = 'Lorem Ipsum', "author_name" = 'Robert Frost', "body" = 'Wibbles are fun!', "creation_date" = 'February, 20th, 2012', "updated_at" = '2012-02-20 17:49:57.583643' WHERE "articles"."id" = 980190962
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])