project06/app/controllers/gamezs_controller.rb

SELECT "gamezs".* FROM "gamezs"
---
  def index
    @gamezs = Gamez.all

SELECT "gamezs".* FROM "gamezs" WHERE "gamezs"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @gamez = Gamez.find(params[:id])

SELECT "gamezs".* FROM "gamezs" WHERE "gamezs"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @gamez = Gamez.find(params[:id])

INSERT INTO "gamezs" ("created_at", "date_added", "rating", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 13 Apr 2012 03:44:57 UTC +00:00], ["date_added", "MyString"], ["rating", "MyString"], ["title", "MyString"], ["updated_at", Fri, 13 Apr 2012 03:44:57 UTC +00:00]]
---
  def create
    @gamez = Gamez.new(params[:gamez])

    respond_to do |format|
      if @gamez.save

SELECT "gamezs".* FROM "gamezs" WHERE "gamezs"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @gamez = Gamez.find(params[:id])

SELECT "gamezs".* FROM "gamezs" WHERE "gamezs"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "gamezs" WHERE "gamezs"."id" = ?  [["id", 980190962]]
---
  def destroy
    @gamez = Gamez.find(params[:id])
    @gamez.destroy