project06/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def destroy
    @user = User.find(params[:id])