project05/project04/app/views/articles/_form.html.erb

    <%= f.label :author_name %><br />
    <%= f.select :author_name, Author.all.collect {|t| [t.name, t.id] }, {prompt: "--Select an Author--"} %>
---
SELECT "authors".* FROM "authors"