project05/app/views/articles/_form.html.haml

SELECT "authors".* FROM "authors"
---
    %br/
    = f.select :author_name, Author.all.collect {|t| [t.name, t.id] }, {prompt: "--Select an Author--"}
  .field