project05/app/views/articles/index.html.haml

SELECT "authors".* FROM "authors" WHERE "authors"."id" = 0 LIMIT 1
---
        %dl
          %dt= Author.find_by_id(article.author_name)